app/views/posts/index.html.erb

  <ul>
  <% for entry in Imovel.all(:limit => 10, :order => "created_at desc") %>
---
SELECT "imovels".* FROM "imovels" ORDER BY published_at desc LIMIT 10