app/controllers/comentarios_controller.rb

   def create
    @post = Post.find(params[:post_id])
    @comentario = @post.comentarios.create(params[:comentario])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = 1 LIMIT 1
INSERT INTO "comentarios" ("updated_at", "post_id", "autor", "created_at", "conteudo") VALUES ('2011-08-15 00:28:29.828125', 1, 'Cassio', '2011-08-15 00:28:29.828125', 'comentando o primeiro')

   def destroy
    @post = Post.find(params[:post_id])
    @comentario = @post.comentarios.find(params[:id])
    @comentario.destroy
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = 1 LIMIT 1
SELECT "comentarios".* FROM "comentarios" WHERE "comentarios"."id" = 4 AND ("comentarios".post_id = 1) LIMIT 1
DELETE FROM "comentarios" WHERE "comentarios"."id" = 4