app/controllers/posts_controller.rb

INSERT INTO "posts" ("conteudo", "created_at", "titulo", "updated_at") VALUES ('este e o conteudo do primeiro post', '2011-08-15 00:03:19.015625', 'primeiro post', '2011-08-15 00:03:19.015625')
---
  def create
    @post = Post.new(params[:post])

    respond_to do |format|
      if @post.save

SELECT "posts".* FROM "posts" WHERE "posts"."id" = 1 LIMIT 1
UPDATE "posts" SET "conteudo" = 'Marco de lançamento do site', "updated_at" = '2011-08-25 23:28:57.750000', "titulo" = 'Criado o site AntiCorretor' WHERE "posts"."id" = 1
---
  def update
    @post = Post.find(params[:id])

    respond_to do |format|
      if @post.update_attributes(params[:post])